cf_billing/Documents/энргИзменениеПодключенияАбонентовСНТДНТ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>энргИзменениеПодключенияАбонентовСНТДНТ</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.энргТочкиПоставкиСНТ</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СНТДНТПривязан</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СНТДНТПотребление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаПоставкиЮЛПотребление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf_billing/InformationRegisters/энргТочкиПоставкиСНТ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргТочкиПоставкиСНТ</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТочкаПоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СНТДНТПривязан</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СНТДНТПотребление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/Catalogs/энргКлючиПомещений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>энргКлючиПомещений</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Строение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПомещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧастныйСектор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf_billing/Catalogs/энргСтроения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>энргСтроения</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Архив</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бойлер</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидБлагоустройства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыБлагоустройств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОбъектаАбонентов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыОбъектовАбонента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГодПостройки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаПотребителейПоУмолчанию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргГруппыПотребителей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дом</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Индекс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Корпус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаселенныйПункт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Регион</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СлужебныеЗаписки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПлиты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргТипыПлит</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Улица</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЭтажей</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаршрутКонтроллера</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргМаршрутыКонтроллеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСтроения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргТипыСтроений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>удалитьФилиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргФилиалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УлицаНедобавленнаяВФИАС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргУлицыНедобавленныеВФИАС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьВетхостьСтроения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаТочекПоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргГруппыТочекПоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОКТМО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВидыБлагоустройстваТарифныеКатегории</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидБлагоустройстваИндивидуальный</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыБлагоустройств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидБлагоустройстваОбщедомовой</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыБлагоустройств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТарифнаяКатегория</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргГруппыПотребителей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf_billing/Documents/энргИзменениеПодключенияАбонентовСНТДНТ/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Объект.Абонент) тогда
		ПолучаемыеРеквизиты = "Строение,Помещение,ЧастныйСектор";
		
		ЗначенияРеквизитовАбонента 	= Обработки.энргАбонентыМенеджер.ЗначенияРеквизитовОбъекта(Объект.Абонент,ПолучаемыеРеквизиты);
		Строение		 			= ЗначенияРеквизитовАбонента.Строение;
		Помещение 					= ЗначенияРеквизитовАбонента.Помещение;
		ЧастныйСектор 				= ЗначенияРеквизитовАбонента.ЧастныйСектор;
		
		ПолучитьДанныеСНТ(Объект.Дата, Объект.Организация, Объект.Район, Объект.Абонент);
	КонецЕсли;
КонецПроцедуры

 &НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ПолучитьДанныеСНТ(Объект.Дата, Объект.Организация, Объект.Район, Объект.Абонент);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимостьСНТСтало();
	ВычитатьОбъемИзОбъемаЮЛ = ЗначениеЗаполнено(Объект.ТочкаПоставкиЮЛПотребление);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
			
		ДанныеНеИзменены = (Объект.СНТДНТПривязан = СНТДНТПривязанДо
							и Объект.СНТДНТПотребление = СНТДНТПотреблениеДо
							и Объект.ТочкаПоставкиЮЛПотребление = ТочкаПоставкиЮЛПотреблениеДо);
		
		Если ДанныеНеИзменены Тогда 
			Отказ = Истина;  
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Измените параметры подключения абонента СНТ/ДНТ (Стало).'"));
		КонецЕсли;
КонецПроцедуры

#КонецОбласти 

#Область СобытияЭлементовШапки

&НаКлиенте
Процедура СНТДНТПривязанПриИзменении(Элемент)
	УстановитьВидимостьСНТСтало();
	Если Не ЗначениеЗаполнено(Объект.СНТДНТПривязан) Тогда   
		Объект.ТочкаПоставкиЮЛПотребление = ПредопределенноеЗначение("Справочник.энргТочкиУчета.ПустаяСсылка");
		Объект.СНТДНТПотребление = ПредопределенноеЗначение("Справочник.энргДоговорыКонтрагентов.ПустаяСсылка");
		ВычитатьОбъемИзОбъемаЮЛ	 = Ложь;
	Иначе 
		Если Не ЗначениеЗаполнено(Объект.СНТДНТПотребление) Тогда
			Объект.СНТДНТПотребление = Объект.СНТДНТПривязан;
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТочкаПоставкиЮЛПотреблениеПриИзменении(Элемент)
	ВычитатьОбъемИзОбъемаЮЛ = ЗначениеЗаполнено(Объект.ТочкаПоставкиЮЛПотребление);
КонецПроцедуры

&НаКлиенте
Процедура АбонентПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Абонент) тогда
		энргПользовательскийВводКлиент.ПриИзмененииАбонента(ЭтаФорма);
		ПолучитьДанныеСНТ(Объект.Дата, Объект.Организация, Объект.Район, Объект.Абонент);
	иначе
		ИначеЗаполнитьРеквизитыПустойСсылкой();
	КонецЕсли; 
	
	СНТСталоПриИзмененииШапки();

КонецПроцедуры 

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Абонент) тогда
		энргПользовательскийВводКлиент.ПриИзмененииАбонента(ЭтаФорма);
		ПолучитьДанныеСНТ(Объект.Дата, Объект.Организация, Объект.Район, Объект.Абонент);
	иначе
		ИначеЗаполнитьРеквизитыПустойСсылкой();
	КонецЕсли; 
	
	СНТСталоПриИзмененииШапки();

КонецПроцедуры

&НаКлиенте
Процедура ТочкаПоставкиЮЛПотреблениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	МассивПараметров 	= Новый Массив;
    НовыйПараметр 		= Новый ПараметрВыбора("Отбор.Ссылка", ПолучитьТППоДоговору(Объект.Дата, Объект.СНТДНТПотребление));
    МассивПараметров.Добавить(НовыйПараметр);
	ЗначениеСвойства = Новый ФиксированныйМассив(МассивПараметров);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ТочкаПоставкиЮЛПотребление", "ПараметрыВыбора", ЗначениеСвойства);
КонецПроцедуры 

&НаКлиенте
Процедура СНТДНТПотреблениеПриИзменении(Элемент)  
	
	Если Не ЗначениеЗаполнено(Объект.СНТДНТПотребление) Тогда   
		Объект.ТочкаПоставкиЮЛПотребление = ПредопределенноеЗначение("Справочник.энргТочкиУчета.ПустаяСсылка");
		ВычитатьОбъемИзОбъемаЮЛ	 = Ложь;	
	КонецЕсли;

КонецПроцедуры

#КонецОбласти 

#Область ВспомогательныеПроцедурыИФункции 

&НаСервере
Процедура ПолучитьДанныеСНТ(Период, Организация, Район, Абонент)
	
	ПериодЗапроса = Новый Граница(Период, ВидГраницы.Исключая);
	
	ВыборкаДанныеСНТ =  РегистрыСведений.энргТочкиПоставкиСНТ.ПолучитьДанныеСНТ(ПериодЗапроса, Организация, Район, Абонент);
	
	ЗапросПустой = Истина;
	
	Пока ВыборкаДанныеСНТ.Следующий() Цикл
		ТочкаПоставкиЮЛПотреблениеДо = ВыборкаДанныеСНТ.ТочкаПоставки;
		СНТДНТПривязанДо 			 = ВыборкаДанныеСНТ.СНТДНТПривязан;
		СНТДНТПотреблениеДо 		 = ВыборкаДанныеСНТ.СНТДНТПотребление;
		ЗапросПустой = Ложь;
	КонецЦикла;
	
	Если ЗапросПустой Тогда
		ТочкаПоставкиЮЛПотреблениеДо = Справочники.энргТочкиУчета.ПустаяСсылка();   
		СНТДНТПривязанДо 			 = Справочники.энргДоговорыКонтрагентов.ПустаяСсылка();
		СНТДНТПотреблениеДо 		 = Справочники.энргДоговорыКонтрагентов.ПустаяСсылка();	
	КонецЕсли;
	
	ВычитатьОбъемИзОбъемаЮЛДо = ЗначениеЗаполнено(ТочкаПоставкиЮЛПотреблениеДо);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьСНТСтало()
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаСкрываемаяСНТСтало", 
		"Видимость", ЗначениеЗаполнено(Объект.СНТДНТПривязан));
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТППоДоговору(Период, СНТДНТПотребление)
	 Возврат бестРаботаСТочкамиУчетаНПСервер.ПолучитьТППоДоговору(Период, СНТДНТПотребление);	
КонецФункции 
 
&НаКлиенте
Процедура СНТСталоПриИзмененииШапки()
	Объект.ТочкаПоставкиЮЛПотребление = ТочкаПоставкиЮЛПотреблениеДо;
	Объект.СНТДНТПривязан 			  = СНТДНТПривязанДо;
	Объект.СНТДНТПотребление 		  = СНТДНТПотреблениеДо;
	ВычитатьОбъемИзОбъемаЮЛ = ЗначениеЗаполнено(Объект.ТочкаПоставкиЮЛПотребление);
	УстановитьВидимостьСНТСтало(); 	
КонецПроцедуры  

&НаКлиенте
Процедура ИначеЗаполнитьРеквизитыПустойСсылкой()
	Объект.КлючПомещения		 = ПредопределенноеЗначение("Справочник.энргКлючиПомещений.ПустаяСсылка");
	ЭтаФорма.Помещение 			 = ПредопределенноеЗначение("Справочник.энргПомещения.ПустаяСсылка");
	ЭтаФорма.Строение 			 = ПредопределенноеЗначение("Справочник.энргСтроения.ПустаяСсылка");
	ТочкаПоставкиЮЛПотреблениеДо = ПредопределенноеЗначение("Справочник.энргТочкиУчета.ПустаяСсылка");   
	СНТДНТПривязанДо 			 = ПредопределенноеЗначение("Справочник.энргДоговорыКонтрагентов.ПустаяСсылка");
	СНТДНТПотреблениеДо 		 = ПредопределенноеЗначение("Справочник.энргДоговорыКонтрагентов.ПустаяСсылка");
	ВычитатьОбъемИзОбъемаЮЛДо	 = Ложь;	
КонецПроцедуры

#КонецОбласти
